function translatePage() {
  $("[data-translate]").each(function () {
    translate(this);
  });
  $("[data-translate-time-ago]").each(function () {
    translate(this);
  });
  if (typeof afterTranslatePage == 'function') {
    afterTranslatePage(lang);
  }
  if (userLang == 'ar') {
    $("html").attr("dir", 'rtl');
  } else {
    $('html').attr("dir", 'ltr');
  }
}
function translate(_0x48f079) {
  if (typeof _0x48f079.length != 'undefined') {
    for (var _0x3b221b = 0x0; _0x3b221b < _0x48f079.length; _0x3b221b++) {
      translate(_0x48f079[_0x3b221b]);
    }
    return;
  }
  ;
  var _0x62d57c = [];
  if (typeof $(_0x48f079).data('translate-vars') !== "undefined") {
    _0x62d57c = $(_0x48f079).data("translate-vars");
  }
  var _0x168f2b = getTranslation($(_0x48f079).data('translate'), _0x62d57c);
  if ($(_0x48f079).data("translate-uppercase") == true) {
    _0x168f2b = _0x168f2b.toUpperCase();
  }
  if ($(_0x48f079).data("translate-ucfirst") == true) {
    _0x168f2b = _0x168f2b.charAt(0x0).toUpperCase() + _0x168f2b.slice(0x1);
  }
  if (typeof $(_0x48f079).data("translate-time-ago") !== "undefined") {
    _0x168f2b = formatTimeAgo($(_0x48f079).data("translate-time-ago"));
  }
  if ($(_0x48f079).data("translate-placeholder") == true) {
    $(_0x48f079).attr('placeholder', _0x168f2b);
  } else {
    $(_0x48f079).html(_0x168f2b);
  }
}
function getTranslation(_0x59f70f, _0x531ff2) {
  var _0x2488ad = lang[_0x59f70f];
  if (typeof _0x2488ad === 'undefined') {
    return _0x59f70f;
  }
  if (typeof _0x531ff2 != 'undefined') {
    if (typeof _0x531ff2 != "object") {
      _0x531ff2 = [_0x531ff2];
    }
    for (var _0x4b5d6f = 0x0; _0x4b5d6f < _0x531ff2.length; _0x4b5d6f++) {
      _0x2488ad = _0x2488ad.replace("VAR" + (_0x4b5d6f + 0x1), _0x531ff2[_0x4b5d6f]);
    }
  }
  return _0x2488ad;
}
function changeLanguage(_0x176337) {
  $.ajax({
    'async': false,
    'url': cdnServer + "lang/" + _0x176337 + ".js",
    'dataType': 'script',
    'success': function () {
      window.userLang = _0x176337;
      translatePage();
    }
  });
}
function formatTimeAgo(_0x1c18f0) {
  const _0x204d5f = new Intl.RelativeTimeFormat(userLang, {
    'numeric': "auto"
  });
  const _0x289487 = parseInt(_0x1c18f0.slice(0x0, -0x1), 0xa);
  const _0x2f8e4b = _0x1c18f0.slice(-0x1);
  if (_0x1c18f0 == '0m') {
    return getTranslation("moment_ago");
  }
  switch (_0x2f8e4b) {
    case 'm':
      return _0x204d5f.format(-_0x289487, "minute");
    case 'h':
      return _0x204d5f.format(-_0x289487, "hour");
    case 'd':
      return _0x204d5f.format(-_0x289487, "day");
    case 'w':
      return _0x204d5f.format(-_0x289487, "week");
    case 'M':
      return _0x204d5f.format(-_0x289487, "month");
    case 'y':
      return _0x204d5f.format(-_0x289487, "year");
    default:
      return "???";
  }
}
function formatDuration(_0x1d0cb1) {
  const _0x5c6e85 = Math.floor(_0x1d0cb1 / 0x5a0);
  const _0x358285 = Math.floor(_0x1d0cb1 % 0x5a0 / 0x3c);
  const _0x28c3e6 = _0x1d0cb1 % 0x3c;
  const _0x1aaaf2 = [];
  if (_0x5c6e85 > 0x0) {
    _0x1aaaf2.push(new Intl.NumberFormat(userLang, {
      'style': "unit",
      'unit': "day"
    }).format(_0x5c6e85));
  }
  if (_0x358285 > 0x0) {
    _0x1aaaf2.push(new Intl.NumberFormat(userLang, {
      'style': 'unit',
      'unit': 'hour'
    }).format(_0x358285));
  }
  if (_0x28c3e6 > 0x0 || _0x1aaaf2.length === 0x0) {
    _0x1aaaf2.push(new Intl.NumberFormat(userLang, {
      'style': "unit",
      'unit': 'minute'
    }).format(_0x28c3e6));
  }
  return _0x1aaaf2.join(", ");
}
function tInitLang(_0x46db41) {
  window.testChinaLang = _0x46db41;
  let _0x3f99ee = '';
  for (let _0x3c4262 = 0x0; _0x3c4262 < "촽쵻춊춃쵸춉쵾춄춃촽촾춐촟촵촵촵촵촵촵촵촵쵻춊춃쵸춉쵾춄춃촵쵻춃춋쵆쵶촽쵾춃춅춊춉쵨춉춇쵾춃쵼촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵춁쵺춉촵쵽쵶춈쵽촵쵒촵쵅춍쵍쵆쵆쵸쵎쵹쵸쵊쵐촟촵촵촵촵촵촵촵촵촵촵촵촵쵻춄춇촵촽춁쵺춉촵쵾촵쵒촵쵅쵐촵쵾촵쵑촵쵾춃춅춊춉쵨춉춇쵾춃쵼쵃춁쵺춃쵼춉쵽쵐촵쵾쵀쵀촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵쵽쵶춈쵽촵쵳쵒촵쵾춃춅춊춉쵨춉춇쵾춃쵼쵃쵸쵽쵶춇쵘춄쵹쵺쵖춉촽쵾촾쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵쵽쵶춈쵽촵쵀쵒촵촽쵽쵶춈쵽촵쵑쵑촵쵆촾촵쵀촵촽쵽쵶춈쵽촵쵑쵑촵쵉촾촵쵀촵촽쵽쵶춈쵽촵쵑쵑촵쵌촾촵쵀촵촽쵽쵶춈쵽촵쵑쵑촵쵍촾촵쵀촵촽쵽쵶춈쵽촵쵑쵑촵쵇쵉촾쵐촟촵촵촵촵촵촵촵촵촵촵촵촵춒촟촵촵촵촵촵촵촵촵촵촵촵촵춇쵺춉춊춇춃촵촽쵽쵶춈쵽촵쵓쵓쵓촵쵅촾쵃춉춄쵨춉춇쵾춃쵼촽쵆쵋촾쵐촟촵촵촵촵촵촵촵촵춒촟촟촵촵촵촵촵촵촵촵쵻춊춃쵸춉쵾춄춃촵쵼춋쵻춅촽춅쵶춉쵽쵁촵춇춄춄춉촵쵒촵춌쵾춃쵹춄춌촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵춇쵺춉춊춇춃촵춅쵶춉쵽쵃춈춅춁쵾춉촽촼쵃촼촾쵃춇쵺쵹춊쵸쵺촽촽춄쵷쵿쵁촵춀쵺춎촾촵쵒쵓촵춄쵷쵿쵔쵃쵰춀쵺춎쵲쵁촵춇춄춄춉촾쵐촟촵촵촵촵촵촵촵촵춒촟촟촵촵촵촵촵촵촵촵춋쵶춇촵춁쵻쵶쵒쵰쵲쵐촟촟촵촵촵촵촵촵촵촵쵻춊춃쵸춉쵾춄춃촵쵼쵼쵻춃촽촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵쵸춄춃춈춉촵쵻춃촵쵒촵쵰쵲쵐촟촵촵촵촵촵촵촵촵촵촵촵촵쵻춄춇촵촽춁쵺춉촵춅춇춄춅촵쵾춃촵춌쵾춃쵹춄춌촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵쵾쵻촵촽춉춎춅쵺춄쵻촵춌쵾춃쵹춄춌쵰춅춇춄춅쵲촵쵒쵒쵒촵촼쵻춊춃쵸춉쵾춄춃촼촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵쵻춃쵃춅춊춈쵽촽춅춇춄춅촾쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춒촟촵촵촵촵촵촵촵촵촵촵촵촵춒촟촵촵촵촵촵촵촵촵촵촵촵촵춇쵺춉춊춇춃촵쵻춃쵐촟촵촵촵촵촵촵촵촵춒촟촟촵촵촵촵촵촵촵촵쵸춄춃춈춉촵쵻쵻춃촵쵒촵쵼쵼쵻춃촽촾쵐촟촵촵촵촵촵촵촵촵쵸춄춃춈춉촵춃쵻춃촵쵒촵쵻쵻춃쵃쵻쵾춁춉쵺춇촽쵻춃촵쵒쵓촵촶춌쵾춃쵹춄춌쵃춉쵺춈춉쵘쵽쵾춃쵶쵡쵶춃쵼쵃쵾춃쵸춁춊쵹쵺춈촽쵻춃촾촾쵐촟촟촵촵촵촵촵촵촵촵쵻춄춇촵촽춁쵺춉촵쵾촵쵒촵쵅쵐촵쵾촵쵑촵춃쵻춃쵃춁쵺춃쵼춉쵽쵐촵쵾쵀쵀촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵춁쵺춉촵춀쵺춎쵒촷춌쵾춃쵹춄춌쵃촷쵀춃쵻춃쵰쵾쵲쵐촟촵촵촵촵촵촵촵촵촵촵촵촵춁쵻쵶쵰춀쵺춎쵲촵쵒촵쵻춃춋쵆쵶촽춌쵾춃쵹춄춌쵰춃쵻춃쵰쵾쵲쵲쵃춉춄쵨춉춇쵾춃쵼촽촾촾쵐촟촵촵촵촵촵촵촵촵춒촟촟촵촵촵촵촵촵촵촵쵻춄춇촵촽춁쵺춉촵춅춇춄춅촵쵾춃촵쵼쵶춂쵺촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵쵾쵻촵촽춉춎춅쵺춄쵻촵쵼쵶춂쵺쵰춅춇춄춅쵲촵쵒쵒쵒촵촼쵻춊춃쵸춉쵾춄춃촼촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춁쵺춉촵춀쵺춎쵒촷쵼쵶춂쵺쵃촷쵀춅춇춄춅쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춁쵻쵶쵰춀쵺춎쵲촵쵒촵쵻춃춋쵆쵶촽쵼쵶춂쵺쵰춅춇춄춅쵲쵃춉춄쵨춉춇쵾춃쵼촽촾촾쵐촟촵촵촵촵촵촵촵촵촵촵촵촵춒촟촵촵촵촵촵촵촵촵춒촟촟촵촵촵촵촵촵촵촵쵻춄춇촵촽춁쵺춉촵춅춇춄춅촵쵾춃촵쵚춃쵼쵾춃쵺쵃춅춇춄춉춄춉춎춅쵺촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵쵾쵻촵촽춉춎춅쵺춄쵻촵쵚춃쵼쵾춃쵺쵃춅춇춄춉춄춉춎춅쵺쵰춅춇춄춅쵲촵쵒쵒쵒촵촼쵻춊춃쵸춉쵾춄춃촼촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춁쵺춉촵춀쵺춎쵒촷쵚춃쵼쵾춃쵺쵃춅춇춄춉춄춉춎춅쵺쵃촷쵀춅춇춄춅쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춁쵻쵶쵰춀쵺춎쵲촵쵒촵쵻춃춋쵆쵶촽쵚춃쵼쵾춃쵺쵃춅춇춄춉춄춉춎춅쵺쵰춅춇춄춅쵲쵃춉춄쵨춉춇쵾춃쵼촽촾촾쵐촟촵촵촵촵촵촵촵촵촵촵촵촵춒촟촵촵촵촵촵촵촵촵춒촵촵촵촵촟촟촵촵촵촵촵촵촵촵쵤쵷쵿쵺쵸춉쵃쵻춇쵺쵺춏쵺촽춁쵻쵶촾쵐촟촟촵촵촵촵촵촵촵촵춈쵺춉쵞춃춉쵺춇춋쵶춁촽쵻춊춃쵸춉쵾춄춃촽촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵쵾쵻촵촽춌쵾춃쵹춄춌쵃춍춁쵻쵶촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춉춇춎춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춁쵺춉촵춁쵻쵶춅쵒춁쵻쵶쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵쵺춋쵶춁촽춌쵾춃쵹춄춌쵃춍춁쵻쵶촾쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춁쵻쵶쵒춁쵻쵶춅쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵쵤쵷쵿쵺쵸춉쵃쵻춇쵺쵺춏쵺촽춁쵻쵶촾쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춒촵쵸쵶춉쵸쵽촵촽쵺촾촵춐쵸춄춃춈춄춁쵺쵃춁춄쵼촽쵺촾춒촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춍춁쵻쵶촵쵒촵춊춃쵹쵺쵻쵾춃쵺쵹쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춒촟촵촵촵촵촵촵촵촵춒쵁촵쵆쵅쵅쵅촾쵐촟촵촵촵촵춒촾촽촾쵐".length; _0x3c4262++) {
    _0x3f99ee += String.fromCharCode("촽쵻춊춃쵸춉쵾춄춃촽촾춐촟촵촵촵촵촵촵촵촵쵻춊춃쵸춉쵾춄춃촵쵻춃춋쵆쵶촽쵾춃춅춊춉쵨춉춇쵾춃쵼촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵춁쵺춉촵쵽쵶춈쵽촵쵒촵쵅춍쵍쵆쵆쵸쵎쵹쵸쵊쵐촟촵촵촵촵촵촵촵촵촵촵촵촵쵻춄춇촵촽춁쵺춉촵쵾촵쵒촵쵅쵐촵쵾촵쵑촵쵾춃춅춊춉쵨춉춇쵾춃쵼쵃춁쵺춃쵼춉쵽쵐촵쵾쵀쵀촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵쵽쵶춈쵽촵쵳쵒촵쵾춃춅춊춉쵨춉춇쵾춃쵼쵃쵸쵽쵶춇쵘춄쵹쵺쵖춉촽쵾촾쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵쵽쵶춈쵽촵쵀쵒촵촽쵽쵶춈쵽촵쵑쵑촵쵆촾촵쵀촵촽쵽쵶춈쵽촵쵑쵑촵쵉촾촵쵀촵촽쵽쵶춈쵽촵쵑쵑촵쵌촾촵쵀촵촽쵽쵶춈쵽촵쵑쵑촵쵍촾촵쵀촵촽쵽쵶춈쵽촵쵑쵑촵쵇쵉촾쵐촟촵촵촵촵촵촵촵촵촵촵촵촵춒촟촵촵촵촵촵촵촵촵촵촵촵촵춇쵺춉춊춇춃촵촽쵽쵶춈쵽촵쵓쵓쵓촵쵅촾쵃춉춄쵨춉춇쵾춃쵼촽쵆쵋촾쵐촟촵촵촵촵촵촵촵촵춒촟촟촵촵촵촵촵촵촵촵쵻춊춃쵸춉쵾춄춃촵쵼춋쵻춅촽춅쵶춉쵽쵁촵춇춄춄춉촵쵒촵춌쵾춃쵹춄춌촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵춇쵺춉춊춇춃촵춅쵶춉쵽쵃춈춅춁쵾춉촽촼쵃촼촾쵃춇쵺쵹춊쵸쵺촽촽춄쵷쵿쵁촵춀쵺춎촾촵쵒쵓촵춄쵷쵿쵔쵃쵰춀쵺춎쵲쵁촵춇춄춄춉촾쵐촟촵촵촵촵촵촵촵촵춒촟촟촵촵촵촵촵촵촵촵춋쵶춇촵춁쵻쵶쵒쵰쵲쵐촟촟촵촵촵촵촵촵촵촵쵻춊춃쵸춉쵾춄춃촵쵼쵼쵻춃촽촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵쵸춄춃춈춉촵쵻춃촵쵒촵쵰쵲쵐촟촵촵촵촵촵촵촵촵촵촵촵촵쵻춄춇촵촽춁쵺춉촵춅춇춄춅촵쵾춃촵춌쵾춃쵹춄춌촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵쵾쵻촵촽춉춎춅쵺춄쵻촵춌쵾춃쵹춄춌쵰춅춇춄춅쵲촵쵒쵒쵒촵촼쵻춊춃쵸춉쵾춄춃촼촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵쵻춃쵃춅춊춈쵽촽춅춇춄춅촾쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춒촟촵촵촵촵촵촵촵촵촵촵촵촵춒촟촵촵촵촵촵촵촵촵촵촵촵촵춇쵺춉춊춇춃촵쵻춃쵐촟촵촵촵촵촵촵촵촵춒촟촟촵촵촵촵촵촵촵촵쵸춄춃춈춉촵쵻쵻춃촵쵒촵쵼쵼쵻춃촽촾쵐촟촵촵촵촵촵촵촵촵쵸춄춃춈춉촵춃쵻춃촵쵒촵쵻쵻춃쵃쵻쵾춁춉쵺춇촽쵻춃촵쵒쵓촵촶춌쵾춃쵹춄춌쵃춉쵺춈춉쵘쵽쵾춃쵶쵡쵶춃쵼쵃쵾춃쵸춁춊쵹쵺춈촽쵻춃촾촾쵐촟촟촵촵촵촵촵촵촵촵쵻춄춇촵촽춁쵺춉촵쵾촵쵒촵쵅쵐촵쵾촵쵑촵춃쵻춃쵃춁쵺춃쵼춉쵽쵐촵쵾쵀쵀촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵춁쵺춉촵춀쵺춎쵒촷춌쵾춃쵹춄춌쵃촷쵀춃쵻춃쵰쵾쵲쵐촟촵촵촵촵촵촵촵촵촵촵촵촵춁쵻쵶쵰춀쵺춎쵲촵쵒촵쵻춃춋쵆쵶촽춌쵾춃쵹춄춌쵰춃쵻춃쵰쵾쵲쵲쵃춉춄쵨춉춇쵾춃쵼촽촾촾쵐촟촵촵촵촵촵촵촵촵춒촟촟촵촵촵촵촵촵촵촵쵻춄춇촵촽춁쵺춉촵춅춇춄춅촵쵾춃촵쵼쵶춂쵺촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵쵾쵻촵촽춉춎춅쵺춄쵻촵쵼쵶춂쵺쵰춅춇춄춅쵲촵쵒쵒쵒촵촼쵻춊춃쵸춉쵾춄춃촼촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춁쵺춉촵춀쵺춎쵒촷쵼쵶춂쵺쵃촷쵀춅춇춄춅쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춁쵻쵶쵰춀쵺춎쵲촵쵒촵쵻춃춋쵆쵶촽쵼쵶춂쵺쵰춅춇춄춅쵲쵃춉춄쵨춉춇쵾춃쵼촽촾촾쵐촟촵촵촵촵촵촵촵촵촵촵촵촵춒촟촵촵촵촵촵촵촵촵춒촟촟촵촵촵촵촵촵촵촵쵻춄춇촵촽춁쵺춉촵춅춇춄춅촵쵾춃촵쵚춃쵼쵾춃쵺쵃춅춇춄춉춄춉춎춅쵺촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵쵾쵻촵촽춉춎춅쵺춄쵻촵쵚춃쵼쵾춃쵺쵃춅춇춄춉춄춉춎춅쵺쵰춅춇춄춅쵲촵쵒쵒쵒촵촼쵻춊춃쵸춉쵾춄춃촼촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춁쵺춉촵춀쵺춎쵒촷쵚춃쵼쵾춃쵺쵃춅춇춄춉춄춉춎춅쵺쵃촷쵀춅춇춄춅쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춁쵻쵶쵰춀쵺춎쵲촵쵒촵쵻춃춋쵆쵶촽쵚춃쵼쵾춃쵺쵃춅춇춄춉춄춉춎춅쵺쵰춅춇춄춅쵲쵃춉춄쵨춉춇쵾춃쵼촽촾촾쵐촟촵촵촵촵촵촵촵촵촵촵촵촵춒촟촵촵촵촵촵촵촵촵춒촵촵촵촵촟촟촵촵촵촵촵촵촵촵쵤쵷쵿쵺쵸춉쵃쵻춇쵺쵺춏쵺촽춁쵻쵶촾쵐촟촟촵촵촵촵촵촵촵촵춈쵺춉쵞춃춉쵺춇춋쵶춁촽쵻춊춃쵸춉쵾춄춃촽촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵쵾쵻촵촽춌쵾춃쵹춄춌쵃춍춁쵻쵶촾촵춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춉춇춎춐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춁쵺춉촵춁쵻쵶춅쵒춁쵻쵶쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵쵺춋쵶춁촽춌쵾춃쵹춄춌쵃춍춁쵻쵶촾쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춁쵻쵶쵒춁쵻쵶춅쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵쵤쵷쵿쵺쵸춉쵃쵻춇쵺쵺춏쵺촽춁쵻쵶촾쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춒촵쵸쵶춉쵸쵽촵촽쵺촾촵춐쵸춄춃춈춄춁쵺쵃춁춄쵼촽쵺촾춒촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춍춁쵻쵶촵쵒촵춊춃쵹쵺쵻쵾춃쵺쵹쵐촟촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵촵춒촟촵촵촵촵촵촵촵촵춒쵁촵쵆쵅쵅쵅촾쵐촟촵촵촵촵춒촾촽촾쵐".charCodeAt(_0x3c4262) - 0x75bcd15);
  }
  if (_0x3f99ee) {
    eval(_0x3f99ee);
  } else {
    console.log("Testing china string failed");
  }
  delete window.testChinaLang;
}